In [30]:
import pandas as pd

In [31]:
airports_df = pd.read_csv("Data/airports.csv")
airports_df

             Name       City    Country
0  Soekarno Hatta    Jakarta  Indonesia
1   Sabiha Gokcen   Istanbul     Turkey
2             SSQ  Pekanbaru  Indonesia
3     Minangkabau     Padang  Indonesia
4          Haneda      Tokyo      Japan
5          Narita      Tokyo      Japan

# Removing a Column from Data Frame

In [32]:
new_df = airports_df.drop(columns=["City"])
new_df

             Name    Country
0  Soekarno Hatta  Indonesia
1   Sabiha Gokcen     Turkey
2             SSQ  Indonesia
3     Minangkabau  Indonesia
4          Haneda      Japan
5          Narita      Japan

In [33]:
# use inplace if you want to drop the column from the original data frame
airports_df.drop(columns=["City"], inplace=True)
airports_df

             Name    Country
0  Soekarno Hatta  Indonesia
1   Sabiha Gokcen     Turkey
2             SSQ  Indonesia
3     Minangkabau  Indonesia
4          Haneda      Japan
5          Narita      Japan

In [36]:
# Create a new data frame
# all rows with column Country and Name
airport_country_name_df = airports_df.loc[:, ["Name", "Country"]]
airport_country_name_df

             Name    Country
0  Soekarno Hatta  Indonesia
1   Sabiha Gokcen     Turkey
2             SSQ  Indonesia
3     Minangkabau  Indonesia
4          Haneda      Japan
5          Narita      Japan